index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-09 Fri 15:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>mkronvold org mode site</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike-Adamant" />
<link rel="stylesheet" type="text/css" href="https://mkronvold.github.io/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://mkronvold.github.io/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">mkronvold org mode site</h1>

<div id="outline-container-orgf2e838d" class="outline-2">
<h2 id="orgf2e838d"><span class="section-number-2">1</span> Kronvold.org</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7ae7e57" class="outline-3">
<h3 id="org7ae7e57"><span class="section-number-3">1.1</span> Archive</h3>
</div>
<div id="outline-container-orge2a9dd3" class="outline-3">
<h3 id="orge2a9dd3"><span class="section-number-3">1.2</span> Monday</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4abdc41" class="outline-4">
<h4 id="org4abdc41"><span class="section-number-4">1.2.1</span> Labels</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>no more create without labels as of (talk about it monday)</li>
<li>make list of everything that needs to be labeled (project for ops to label everything)
<ul class="org-ul">
<li>namespaces</li>
<li>all vm's get a label
<ul class="org-ul">
<li>supervisors are department: Hosting operations</li>
<li>tkc VM's are are Subscription ARR</li>
<li>tkc's and namespaces</li>
</ul></li>
<li>Solution = tanzu?  normally a product, what do we use here for vsphere?  elastic search?</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org60e2e54" class="outline-3">
<h3 id="org60e2e54"><span class="section-number-3">1.3</span> Tuesday</h3>
</div>
<div id="outline-container-org978ec45" class="outline-3">
<h3 id="org978ec45"><span class="section-number-3">1.4</span> Wednesday</h3>
</div>
<div id="outline-container-org027ddbe" class="outline-3">
<h3 id="org027ddbe"><span class="section-number-3">1.5</span> Thursday</h3>
</div>
<div id="outline-container-org1b1a120" class="outline-3">
<h3 id="org1b1a120"><span class="section-number-3">1.6</span> Friday</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org4687d45" class="outline-4">
<h4 id="org4687d45"><span class="section-number-4">1.6.1</span> 6/9/23</h4>
<div class="outline-text-4" id="text-1-6-1">
</div>
<ol class="org-ol">
<li><a id="org465167e"></a>E2net Update<br /></li>
<li><a id="org5bfa407"></a>Cleanup of unused TKCs<br />
<div class="outline-text-5" id="text-1-6-1-2">
<ul class="org-ul">
<li>3 more scheduled to remove, waiting on confirmation</li>
</ul>
</div>
</li>
<li><a id="org029d75a"></a>Cloudy/JIRA<br />
<div class="outline-text-5" id="text-1-6-1-3">
<ul class="org-ul">
<li>Devops might have time in 2-3 weeks</li>
<li>Scheduling call to get all the requirements defined ahead of time</li>
<li>will need some backing of both DCOps and R&amp;D for this to work</li>
</ul>
</div>
</li>
<li><a id="orgd606119"></a>OCVS load balancer<br />
<div class="outline-text-5" id="text-1-6-1-4">
<ul class="org-ul">
<li>AVI</li>
<li>This will probably require several detailed sessions with vmware
<ul class="org-ul">
<li>possibly a full workshop</li>
</ul></li>
<li>self-healing software-defined elastic application delivery fabric, that just so happens to provide load balancing features
<ul class="org-ul">
<li>also provides WAF, appalytics</li>
<li>solves ip pool issues</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org93f495e"></a>Netapp Cloud Insights<br />
<div class="outline-text-5" id="text-1-6-1-5">
<ul class="org-ul">
<li>Suggest we have Joel work with Adam on setup and implementation</li>
<li>Tim, HY, Joel, You and I should brainstorm a list of what we want to get out of it.
<ul class="org-ul">
<li>fancy notetaking, mind mapping</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orge3c246c"></a>NSX-T updates<br />
<div class="outline-text-5" id="text-1-6-1-6">
<ul class="org-ul">
<li>Original suspected patch that caused issue deployed to dev, stg, shg</li>
<li>Fix now deployed in dev
<ul class="org-ul">
<li>No issues observes fo far.</li>
<li>Can take a while to show symptoms</li>
<li>also includes some critical security fixes</li>
</ul></li>
<li>Fix Scheduled for staging this weekend
<ul class="org-ul">
<li>More non-prod locations the better I feel about prod</li>
</ul></li>
<li>Prod will be scheduled for next CI window
<ul class="org-ul">
<li>couple months?</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0e5f915" class="outline-4">
<h4 id="org0e5f915"><span class="section-number-4">1.6.2</span> 6/16/23</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike-Adamant</p>
<p class="date">Created: 2023-06-09 Fri 15:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
